src/DataProcessors/ОбновлениеИнформационнойБазы/ОбновлениеИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбновлениеИнформационнойБазы</name>
  <attributes>
    <name>ТекущаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХодВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьТекущееСостояние</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПервыйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоПотоковОбновленияИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяВерсияОбновления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ВерсииИнформационнойБазы/ВерсииИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииИнформационнойБазы</name>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцедураОбновления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СообщатьДлительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПервыйЗапуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗавершеноОбновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ОбновлениеИнформационнойБазы/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    Если Объект.ПроверятьТекущееСостояние Тогда
		ПодключитьОбработчикОжидания("ПолучитьТекущееСостояние", 1);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущееСостояние()
	ТекущееСостояние = ПолучитьТекущееСостояниеНаСервере();
	
	Если ТекущееСостояние <> Неопределено Тогда
		Объект.ТекущееЗначение = ТекущееСостояние.ТекущееЗначение;
		Объект.ХодВыполнения = ТекущееСостояние.Комментарий;
		
		Если ТекущееСостояние.ВерсияЧисло <> Неопределено Тогда
			Если ТекущееСостояние.ТекущееЗначение = ТекущееСостояние.МаксимальноеЗначение Тогда
                Если ТекущееСостояние.Версия = Объект.КрайняяВерсияОбновления Тогда
                    Если ТекущееСостояние.ЗавершеноОбновление Тогда
                        Объект.ТекущаяИнформация = НСтр("ru = 'Информационная база успешно обновлена до версии '") + ТекущееСостояние.Версия;
                    Иначе
                        Объект.ТекущаяИнформация = НСтр("ru = 'Идет обновление информационной базы до версии '") + ТекущееСостояние.Версия;
                    КонецЕсли;
                    Объект.ЭтоПервыйЗапуск = Ложь;
                Иначе
                    Объект.ТекущаяИнформация = НСтр("ru = 'Обновление информационной базы не началось!
					|Возможно установлена блокировка выполнения регламентных заданий!'");
                    Объект.ХодВыполнения = "";
				КонецЕсли;
			Иначе
				Если ТекущееСостояние.ВерсияЧисло <> 0 Тогда
					Объект.ТекущаяИнформация = НСтр("ru = 'Идет обновлении информационной базы до версии '") + Объект.КрайняяВерсияОбновления;
				Иначе
					Объект.ТекущаяИнформация = НСтр("ru = 'Обновление информационной базы не началось!
					|Возможно установлена блокировка выполнения регламентных заданий!'");
                    Объект.ХодВыполнения = "";
				КонецЕсли;
			КонецЕсли;
		Иначе
			Объект.ПроверятьТекущееСостояние = Истина;
			Объект.ТекущаяИнформация = НСтр("ru = 'Обновление информационной базы не началось!
			|Возможно установлена блокировка выполнения регламентных заданий!'");
            Объект.ХодВыполнения = "";
			ЭтотОбъект.Элементы.ТекущееЗначение.Видимость = Ложь;
		КонецЕсли;
	Иначе
		ОтключитьОбработчикОжидания("ПолучитьТекущееСостояние");
		Объект.ПроверятьТекущееСостояние = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущееСостояниеНаСервере()
	Результат = Новый Структура("ВерсияЧисло, Версия, ПроцедураОбновления, СообщатьДлительность, ТекущееЗначение, МаксимальноеЗначение, Комментарий, ЗавершеноОбновление");
	
	Если Общий.ВерсияЦКК() <> Общий.СохраненнаяВерсия() Тогда
		ЗавершеноОбновление = Ложь;
	Иначе
		ЗавершеноОбновление = Истина;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВерсииИнформационнойБазы.ВерсияЧисло КАК ВерсияЧисло,
	|	ВерсииИнформационнойБазы.Версия КАК Версия,
	|	ВерсииИнформационнойБазы.ПроцедураОбновления КАК ПроцедураОбновления,
	|	ВерсииИнформационнойБазы.СообщатьДлительность КАК СообщатьДлительность,
	|	ВерсииИнформационнойБазы.ТекущееЗначение КАК ТекущееЗначение,
	|	ВерсииИнформационнойБазы.МаксимальноеЗначение КАК МаксимальноеЗначение,
	|	ВерсииИнформационнойБазы.Комментарий КАК Комментарий,
    |	ВерсииИнформационнойБазы.ЗавершеноОбновление КАК ЗавершеноОбновление
	|ИЗ
	|	РегистрСведений.ВерсииИнформационнойБазы КАК ВерсииИнформационнойБазы
	|ГДЕ
	|	ВерсииИнформационнойБазы.ВерсияЧисло В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(МинимальнаяВерсия.ВерсияЧисло)
	|			ИЗ
	|				РегистрСведений.ВерсииИнформационнойБазы КАК МинимальнаяВерсия
	|			)
	|";
	
	Запрос.УстановитьПараметр("ЗавершеноОбновление", ЗавершеноОбновление);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТекущиеДанные = РезультатЗапроса.Выгрузить()[0];
		Результат.ВерсияЧисло = ТекущиеДанные.ВерсияЧисло;
		Результат.Версия = ТекущиеДанные.Версия;
		Результат.ПроцедураОбновления = ТекущиеДанные.ПроцедураОбновления;
		Результат.СообщатьДлительность = ТекущиеДанные.СообщатьДлительность;
		Результат.ТекущееЗначение = ТекущиеДанные.ТекущееЗначение;
		Результат.МаксимальноеЗначение = ТекущиеДанные.МаксимальноеЗначение;
		Результат.Комментарий = ТекущиеДанные.Комментарий;
        Результат.ЗавершеноОбновление = ТекущиеДанные.ЗавершеноОбновление;
	Иначе
		Результат.ВерсияЧисло = Общий.ВерсияВЧисло(Общий.СохраненнаяВерсия());
		Результат.Версия = Общий.СохраненнаяВерсия();
		Результат.ПроцедураОбновления = "";
		Результат.СообщатьДлительность = Истина;
		Результат.ТекущееЗначение = 0;
		Результат.МаксимальноеЗначение = 100;
		Результат.Комментарий = "";
        Результат.ЗавершеноОбновление = Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ЧислоПотоковОбновленияИБ = Константы.ЧислоПотоковОбновленияИБ.Получить();
	
	Объект.КрайняяВерсияОбновления = Общий.ВерсияЦКК();
	
	Если Общий.НачалосьОбновление() Тогда
		Если Общий.ИдетОбновление() Тогда
			Если Общий.СохраненнаяВерсия() = "" Тогда
				Объект.ЭтоПервыйЗапуск = Истина;
				ТекущееСостояние = ПолучитьТекущееСостояниеНаСервере();
				Если ТекущееСостояние <> Неопределено Тогда
					Объект.ТекущееЗначение = ТекущееСостояние.ТекущееЗначение;
					Объект.ТекущаяИнформация = НСтр("ru = 'Центр Контроля Качества '") + ТекущееСостояние.Версия + ". Первоначальное заполнение данных.";
					Объект.ХодВыполнения = ТекущееСостояние.Комментарий;
					Объект.ПроверятьТекущееСостояние = Истина;
				КонецЕсли;
			Иначе
				Объект.ЭтоПервыйЗапуск = Ложь;
				ТекущееСостояние = ПолучитьТекущееСостояниеНаСервере();
				Если ТекущееСостояние <> Неопределено Тогда
					Объект.ТекущееЗначение = ТекущееСостояние.ТекущееЗначение;
					Объект.ТекущаяИнформация = НСтр("ru = 'Идет обновлении информационной базы до версии '") + Объект.КрайняяВерсияОбновления;
					Объект.ХодВыполнения = ТекущееСостояние.Комментарий;
					Объект.ПроверятьТекущееСостояние = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Объект.ЭтоПервыйЗапуск = Ложь;
			ТекущееСостояние = ПолучитьТекущееСостояниеНаСервере();
			Если ТекущееСостояние <> Неопределено Тогда
				Объект.ПроверятьТекущееСостояние = Ложь;
				
				Объект.ТекущаяИнформация = НСтр("ru = 'Информационная база успешно обновлена до версии '") + ТекущееСостояние.Версия;
				Объект.ХодВыполнения = ТекущееСостояние.Комментарий;
				
				ЭтотОбъект.Элементы.ТекущееЗначение.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Объект.ПроверятьТекущееСостояние = Истина;
		Объект.ТекущаяИнформация = НСтр("ru = 'Обновление информационной базы не началось!
		|Возможно установлена блокировка выполнения регламентных заданий!'");
		ЭтотОбъект.Элементы.ТекущееЗначение.Видимость = Ложь;
		ЭтотОбъект.Элементы.ЧислоПотоковОбновленияИБ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
    
    Если Объект.ЭтоПервыйЗапуск Тогда
        ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
	
	Если ОбщийВызовСервера.ВерсияЦКК() <> ОбщийВызовСервера.СохраненнаяВерсия() Тогда
        ЗавершитьРаботуСистемы(Ложь);
    Иначе
        ФормаПослеОбновления = ФормаПослеОбновления();
        Если ЗначениеЗаполнено(ФормаПослеОбновления) Тогда
            ОткрытьФормуПослеОбновления();
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФормаПослеОбновления()
    Возврат Константы.ПоказатьФормуПослеОбновления.Получить();
КонецФункции

&НаКлиенте
Процедура ЧислоПотоковОбновленияИБПриИзменении(Элемент)
	ЧислоПотоковОбновленияИБПриИзмененииНаСервере(Объект.ЧислоПотоковОбновленияИБ);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЧислоПотоковОбновленияИБПриИзмененииНаСервере(Значение)
	Константы.ЧислоПотоковОбновленияИБ.Установить(Значение);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИБ(Команда)
    
    Объект.ТекущееЗначение = 0;
    ЭтотОбъект.Элементы.ТекущееЗначение.Видимость = Истина;
    ОбновлениеИнформационнойБазыНаСервере();	
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновлениеИнформационнойБазыНаСервере()
    
    ФоновыеЗадания.Выполнить("Общий.ОбновлениеИнформационнойБазы",,"6b08ab2e-4610-4456-b7ed-5ff33a97ec18", "Обновление информационной базы");
    
КонецПроцедуры
